In [15]:
#import libraries

In [1]:
import pandas as pd
import numpy as np

In [ ]:
#import dataset

In [2]:
df_city=pd.read_csv('city_data_delhi.csv')
df_global=pd.read_csv('global_data.csv')

In [10]:
df_global.head(10)
#df_city.head()

   year  avg_temp
0  1750      8.72
1  1751      7.98
2  1752      5.78
3  1753      8.39
4  1754      8.47
5  1755      8.36
6  1756      8.85
7  1757      9.02
8  1758      6.74
9  1759      7.99

In [ ]:
#merge the datasets using inner join based on the column name 'year'.

In [11]:
df=df_city.merge(df_global, how='inner', on='year')

In [ ]:
# rename the columns to indicate the average city temperature and average global temperature.

In [13]:
df=df.rename(columns={'avg_temp_x':'avg_city_temp', 'avg_temp_y':'avg_global_temp'})

In [16]:
df.head()

   year   city country  avg_city_temp  avg_global_temp
0  1796  Delhi   India          25.03             8.27
1  1797  Delhi   India          26.71             8.51
2  1798  Delhi   India          24.29             8.67
3  1799  Delhi   India          25.28             8.51
4  1800  Delhi   India          25.21             8.48

In [17]:
#check is null

In [18]:
df.describe()

              year  avg_city_temp  avg_global_temp
count   218.000000     201.000000       218.000000
mean   1904.500000      25.166269         8.403532
std      63.075352       0.594003         0.548662
min    1796.000000      23.700000         6.860000
25%    1850.250000      24.800000         8.092500
50%    1904.500000      25.140000         8.415000
75%    1958.750000      25.550000         8.727500
max    2013.000000      26.710000         9.730000

In [19]:
#calculate moving average

In [26]:
df['city_moving_avg'] = df.iloc[:,3].rolling(window=7).mean().dropna()

In [29]:
df['city_moving_avg'].dropna()

6      25.195714
7      25.245714
8      25.098571
9      25.242857
10     25.234286
         ...
213    26.061429
214    26.175714
215    26.088571
216    26.112857
217    26.161429
Name: city_moving_avg, Length: 183, dtype: float64

In [31]:
df.head(10)

   year   city country  avg_city_temp  avg_global_temp  city_moving_avg
0  1796  Delhi   India          25.03             8.27              NaN
1  1797  Delhi   India          26.71             8.51              NaN
2  1798  Delhi   India          24.29             8.67              NaN
3  1799  Delhi   India          25.28             8.51              NaN
4  1800  Delhi   India          25.21             8.48              NaN
5  1801  Delhi   India          24.22             8.59              NaN
6  1802  Delhi   India          25.63             8.58        25.195714
7  1803  Delhi   India          25.38             8.50        25.245714
8  1804  Delhi   India          25.68             8.84        25.098571
9  1805  Delhi   India          25.30             8.56        25.242857